#include <stdio.h>
#include <stdlib.h>
#include <string.h>

void reversit ( char *s )
{
    int len = strlen(s);
    // щрхл жхйкнл лгюохяшбюел ярпнйс б напюрмнл онпъдйе мюопхлеп ашкн "йпньйх мнфйх емнрхй" ю ярюмер "йхрнме хйфнм хйьнпй"
    for ( int i = 0; i < len/2; i++ )
    {
        char temp = s [i];
        s[i] = s [len-i-1];
        s [len-i-1] = temp;
        puts(s);// щрнр бшбнд лнфмн сапюрэ нм дкъ мюцкъдмнярх рнцн йюй пюанрюер щрнр жхйк
    }
    //ю щрнр фе жхйк яоепбю б оепбнл якнбе декюер рнфе яюлне врн х жхйк бшье гюрел бн брнпнл х рюй дюкее дн йнмжю
    //мюопхлеп  ашкн с мецн "йхрнме хйфнм хьнпй" ю ярюмер "емнрхй хйфнм хйьнпй" онрнл нм мювмер лемърэ брнпне якнбн "емнрхй мнфйх хйьнпй"
    //гюрел рперэе "емнрхй мнфйх йпньйх"
    for ( int i = 0, j = 0; i <= len; ++i, ++j )
    if ( s[i] == ' ' || s[i] == '\0' )
    {
        for ( int t = 0; t < j/2; ++t )
        {
            char temp = s [i - t - 1];
            s [i - t - 1] = s[i - j + t];
            s [i - j + t] = temp;
            puts(s);// щрнр бшбнд йюй х опедшдсыхи врнаш мюцкъдмн сбхдерэ ецн деиярбхе
        }
        ++i;
        j = 0;
    }
}

int main()
{
    char s[50];
    gets(s);
    reversit (s);
    puts(s);
    system("pause");
    return 0;
}
